#1. დაწერეთ პროგრამა რომელიც input მეთოდის საშუალებით მიიღებს 2 რიცხვს და დააბრუნებს ამ რიცხვებს შორის შესრულებული არითმეტიკული ოპერაციების შედეგებს (მიმატება, გამოკლება, გამრავლება, გაყოფა,ახარისხება).

#2. დაწერეთ პროგრამა რომბის ფართობის გამოსათვლელად. მომხმარებელს კლავიატურის გამოყენებით შეაქვს ორი დიაგონალის სიგრძე.

#3. მომხმარებელის შეაქვს მეტრების რაოდენობა. დაბეჭდეთ შესაბამისი მნიშვნელობა სანტიმეტრებში, დეციმეტრებში, მილიმეტრებში, მილში.

#4. დაწერეთ პროგრამა, რომელიც ითვლის სამკუთხედის ფართობს. მომხმარებელს კონსოლიდან შეყავს სამკუთხედის სიმაღლისა და ფუძის მნიშვნელობა

#1
n = eval(input("შეიყვანეთ რიცხვი: "))
m = eval(input("შეიყვანეთ რიცხვი: "))

x1 = n + m
x2 = n - m
x3 = n * m
x4 = n / m
x5 = n ** m

print(f"ჯამი: {x1}; სხვაობა: {x2}; ნამრავლი: {x3}; განაყოფი: {x4}; ხარისხი: {x5}")


#2

d1 = eval(input("\n\nშეიყვანეთ რომბის პირველი დიაგონალის სიგრძე (სმ): "))
d2 = eval(input("შეიყვანეთ რომბის მეორე დიაგონალის სიგრძე (სმ): "))

fartobi = d1 * d2 /2

print(f"რომბის ფართობი მითითებული დიაგონალების მიხედვით არის {fartobi} სმ")

#3

m = eval(input("\n\nშეიყვანეთ სიდიდე მეტრებში :"))
sm = m * 100
dm = m * 10
mm = m * 1000
mile = m / 1609

print(f"{m} მეტრი არის {sm} სანტიმეტრი,{dm} დეციმეტრი,{mm} მილიმეტრი და {mile} მილი")

#4

a = eval(input("\n\nშეიყვანეთ სამკუთხედის ფუძის სიგრძე (სმ):"))
h = eval(input("შეიყვანეთ სამკუთხედის სიმაღლის მნიშვნელობა (სმ):"))

area = a * h / 2
print(f"სამკუთხედის ფართობი უდრის {area} სანტიმეტრს :) ")
